backend_store/app/controllers/api/v1/games_controller.rb

SELECT "developers".* FROM "developers" WHERE "developers"."id" IN (1, 2, 3, 5, 6)
SELECT "games".* FROM "games"
---
      def index
        @games = Game.includes(:developer).all

SELECT "games".* FROM "games" WHERE "games"."id" = 19 LIMIT 1
UPDATE "games" SET "updated_at" = '2026-06-12 08:02:06.866394', "stock" = 49 WHERE "games"."id" = 19
---
      def checkout
        ActiveRecord::Base.transaction do
          params[:cart].each do |item|
            game = Game.find(item[:id])

            if game.stock >= item[:quantity]
              game.update!(stock: game.stock - item[:quantity])